puts "hello world"
# Операторы
name = "name" # присвоение значений (в примере переменной "name")
1 + 2 # Сложение
2 - 1 # Вычитание
1 * 2 # Умножение
10 / 2 # Деление


# Операторы сравнений
1 == 2 #  "==" "<=" ">=" "<" ">" Сравнивает два числа, выдает результат True или False

# Логические Операторы

# "&&" - Оператор "И" - возвращает true, если оба условия true
true && true
# "||" - Оператор "ИЛИ" - возвращает true, если хотябы одно из условий true
true || False

# Условные выражения
if true
  'Действие'
else
  'Действие'
end

unless false
  'Действие'
end

# Циклы

while condition

end
